# Напишите программу, которая по заданному номеру четверти, показывает диапазон возможных координат точек в этой четверти (x и y).

numberQuarter = int(input('Введите номер четверти, в котором вы хотите узнать диапазон возможных координат для точек: '))

if numberQuarter == 1:
    print('Диапазон возможных координат точек для заданной четверти ->  (x > 0; y > 0)')
elif numberQuarter == 2:
    print('Диапазон возможных координат точек для заданной четверти ->  (x < 0; y > 0)')
elif numberQuarter == 3:
    print('Диапазон возможных координат точек для заданной четверти ->  (x < 0; y < 0)')
elif numberQuarter == 4:
    print('Диапазон возможных координат точек для заданной четверти ->  (x > 0; y < 0)')
else:
    print('На координатной плоскости только 4 четверти, запустите программу снова!')
