#Напишите программу, которая принимает на вход координаты точки (X и Y), причём X ≠ 0 и Y ≠ 0 и выдаёт номер четверти плоскости, в которой находится эта точка (или на какой оси она находится).

x = int(input('Введите координату точки по оси X: '))
y = int(input('Введите координату точки по оси Y: '))

if (x == 0 and y == 0):
    print(f'Точка с координатами ({x};{y}) лежит в точке начала координат')
elif (x == 0):
    print(f'Точка с координатами ({x};{y}) лежит на оси Y')
elif (y == 0):
    print(f'Точка с координатами ({x};{y}) лежит на оси X')
elif (x > 0 and y > 0):
    print(f'Точка с координатами ({x};{y}) лежит в первой четверти плоскости')
elif (x < 0 and y > 0):
    print(f'Точка с координатами ({x};{y}) лежит во второй четверти плоскости')
elif (x < 0 and y < 0):
    print(f'Точка с координатами ({x};{y}) лежит в третьей четверти плоскости')
else :
    print(f'Точка с координатами ({x};{y}) лежит в четвёртой четверти плоскости')

# В условии мне показалось странным что значения координат не должны равняться 0, но при этом, так же в условии, необходимо указать не только четверти, но и на какой оси находится точка. Поэтому написал программу для любых значений координат.