# Напишите программу, которая принимает на вход координаты двух точек и находит расстояние между ними в 2D пространстве.

x1 = float(input('Введите координату по оси X для первой точки: '))
y1 = float(input('Введите координату по оси Y для первой точки: '))
x2 = float(input('Введите координату по оси X для второй точки: '))
y2 = float(input('Введите координату по оси Y для второй точки: '))

distance = (((x2 - x1) ** 2) + ((y2 - y1) ** 2)) ** 0.5
print(f'Расстояние между двумя заданными точками -> {round(distance, 3)}')
