# Напишите программу, которая принимает на вход вещественное число и показывает сумму его цифр.
# Без работы с методами строк.

n = float(input("Введите вещественное число: "))
sum = 0
print(n)
if (n < 0):
    n = -n
print(n)
while (n != int(n)):
    n = n * 10
print(n)
while (n != 0):
    sum = sum + n % 10
    n = n // 10
print(int(sum))
